code-review/NRB_3471_3546/База_Было/InformationRegisters/ПрефиксыНомеровДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрефиксыНомеровДокументов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаОСостоянииСчетаДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОбОперацияхПоСчетуДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйОтчетОСовершеннойОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/НумераторыОбъектов/Ext/Module.bsl
Функция ПолучитьНомерДокументаВРазрезеДня(Документ, Префикс, Дата, Знач ПервыйСимвол = "Д") Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ИмяДокумента.Ссылка),0) КАК Номер
	|ИЗ
	|	Документ."+ИмяДокумента+" КАК ИмяДокумента
	|ГДЕ
	|	ИмяДокумента.Дата >= &Дата
	|	И ИмяДокумента.МоментВремени < &МоментВремени
	|	И ИмяДокумента.Ссылка <> &Ссылка
	|	И ИмяДокумента.ПометкаУдаления = ЛОЖЬ");
						  
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Если НЕ Документ.Пустая() Тогда
		Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Документ));
	Иначе
		МоментВремени = Новый МоментВремени(Дата+1, Документ);
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат ПервыйСимвол + Префикс + Прав(Формат(Выборка.Номер + 1, "ЧЦ=12; ЧДЦ=0; ЧВН=; ЧГ=0"),11-СтрДлина(Префикс));
	
КонецФункции

// Формирует уникальный номер документа в разрезе минуты.
// 
Функция ПолучитьНомерДокументаВРазрезеМинуты(Документ, Префикс, Дата, Знач ПервыйСимвол = "Д") Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	isNull(КОЛИЧЕСТВО(" + ИмяДокумента + ".Ссылка),0) КАК Номер
	|ИЗ
	|	Документ."+ИмяДокумента+" КАК "+ИмяДокумента+"
	|ГДЕ
	|	"+ИмяДокумента+".Дата >= &Дата
	|	И "+ИмяДокумента+".МоментВремени < &МоментВремени
	|	И "+ИмяДокумента+".ПометкаУдаления = ЛОЖЬ");
						  
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата)+60*60*Час(Дата)+60*Минута(Дата));
	Если НЕ Документ.Пустая() Тогда
		Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Документ));
	Иначе
		МоментВремени = Новый МоментВремени(Дата+1, Документ);
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат ПервыйСимвол + Префикс + Прав(Формат(Выборка.Номер + 1, "ЧЦ=17; ЧДЦ=0; ЧВН=; ЧГ=0"),17-СтрДлина(ПервыйСимвол)-СтрДлина(Префикс));
	
КонецФункции

Функция ПолучитьНомерДокументаВРазрезеМесяца(Документ, Префикс, Дата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	isNull(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ "+Документ.Метаданные().Имя+".Ссылка),0) КАК Номер
	                      |ИЗ
	                      |	Документ."+Документ.Метаданные().Имя+" КАК "+Документ.Метаданные().Имя+"
	                      |ГДЕ
	                      |	"+Документ.Метаданные().Имя+".Дата >= &Дата
	                      |	И "+Документ.Метаданные().Имя+".МоментВремени < &МоментВремени
	                      |	И "+Документ.Метаданные().Имя+".Проведен = ИСТИНА");
	Запрос.УстановитьПараметр("Дата",НачалоМесяца(Документ.Дата));
	Если НЕ Документ.Пустая() Тогда
		Запрос.УстановитьПараметр("МоментВремени",Документ.МоментВремени());
	Иначе
		Запрос.УстановитьПараметр("МоментВремени",Дата+1);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат "Д"+Префикс+Прав("000000000000"+Формат(Выборка.Номер + 1,"ЧДЦ=0; ЧГ=0"),11-СтрДлина(Префикс));
КонецФункции

Функция ЭтоБудетПоследнийДокумент(Дата, НазваниеДокумента) Экспорт
	
	Перем Запрос, Выборка;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Документ.Ссылка
	                      |ИЗ
	                      |	Документ."+НазваниеДокумента+" КАК Документ
	                      |ГДЕ
	                      |	Документ.Дата > &Дата
	                      |	И Документ.ПометкаУдаления = ЛОЖЬ
	                      |	И Документ.Дата <= &ДатаК");
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ДатаК",КонецДня(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Количество() = 1);
	
КонецФункции

Процедура ПеренумероватьДокументыЗаПериод(НачалоПериода, КонецПериода) Экспорт
	
	ПрефиксыДокументов = Новый Массив;
	ПрефиксыДокументов.Добавить("СЛ");
	ПрефиксыДокументов.Добавить("Д");
	ПрефиксыДокументов.Добавить("АД");
		
	ДокументыИПрефиксы = Новый Структура;
	ДокументыИПрефиксы.Вставить("Поручение", 						ПрефиксыДокументов);
	ДокументыИПрефиксы.Вставить("Выписка", 							ПрефиксыДокументов);
	ДокументыИПрефиксы.Вставить("ОткрытиеСчетаДепо", 				ПрефиксыДокументов);
	ДокументыИПрефиксы.Вставить("ЗакрытиеСчетаДепо", 				ПрефиксыДокументов);
	ДокументыИПрефиксы.Вставить("ОткрытиеРазделаСчетаДепо", 		ПрефиксыДокументов);
	ДокументыИПрефиксы.Вставить("НазначениеПредставителяСчетаДепо", ПрефиксыДокументов);	
	
	Для Каждого ДокументИПрефикс Из ДокументыИПрефиксы Цикл
		ИмяДокумента = ДокументИПрефикс.Ключ;
		Префиксы = ДокументИПрефикс.Значение;
		Для Каждого Префикс Из Префиксы Цикл	
			ПеренумероватьДокументыПоПрефиксу(ИмяДокумента, Префикс, НачалоПериода, КонецПериода);
		КонецЦикла; // по префиксам
	КонецЦикла; // по типам документов
	

	Обработка = Обработки.ПеренумерацияДокументов.Создать();
	Выборка = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяДокумента = "Входящий" Тогда
			Обработка.ПеренумероватьДокументы(Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПеренумероватьДокументыЗаПериод()

Процедура ПеренумероватьДокументыПоПрефиксу(ИмяДокумента, Префикс, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбрабатываемыйДокумент.Ссылка,
	|	ОбрабатываемыйДокумент.Номер,"
	+?(ОбщегоНазначения.ЕстьРеквизитДокумента("РучнойВвод", Метаданные.Документы[ИмяДокумента]), "ОбрабатываемыйДокумент.РучнойВвод,", "Ложь КАК РучнойВвод,")+
	"	ОбрабатываемыйДокумент.Дата
	|ИЗ
	|	Документ."+ИмяДокумента+" КАК ОбрабатываемыйДокумент
	|
	|ГДЕ
	|	ОбрабатываемыйДокумент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОбрабатываемыйДокумент.ПометкаУдаления = ЛОЖЬ
	|	И ОбрабатываемыйДокумент.Номер ПОДОБНО """ + Префикс + Формат(НачалоПериода, "ДФ=yy") +"%""
	|   И &Проведенные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбрабатываемыйДокумент.МоментВремени";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ИмяДокумента = "Входящий" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Проведенные", "ОбрабатываемыйДокумент.Проведен");
	Иначе
		Запрос.УстановитьПараметр("Проведенные", Истина);
	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 1;
	ДлинаЧисловойЧастиНомера = 5 - СтрДлина(Префикс);
	Пока Выборка.Следующий() Цикл
		
		ТекущийНомер = Прав(Выборка.Номер, ДлинаЧисловойЧастиНомера);
		РасчетныйНомер = Формат(Счетчик, "ЧЦ=" + ДлинаЧисловойЧастиНомера+"; ЧВН=; ЧГ=0");
		
		Если ТекущийНомер <> РасчетныйНомер И Не Выборка.РучнойВвод Тогда
			
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.Записать();
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ПеренумероватьДокументыПоПрефиксу()

// Получает следующий номер.
//
Функция ПолучитьНомерДокумента(ДокументОбъект, Префикс, ПометкаУдаления = Ложь) Экспорт
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДокументОбъект.Ссылка) КАК Количество,
	|	NULL КАК ЕстьВЭДО,
	|	NULL КАК Перенумерация
	|ПОМЕСТИТЬ ТекущийНомер
	|ИЗ
	|	Документ.Выписка КАК ДокументОбъект
	|ГДЕ
	|	ДокументОбъект.Дата >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ДокументОбъект.ПометкаУдаления = &ПометкаУдаления
	|	И ДокументОбъект.Номер ПОДОБНО &Префикс
	|	И ВЫБОР
	|			КОГДА &ЭтоНовый
	|				ТОГДА ДокументОбъект.Дата <= &Дата
	|			ИНАЧЕ ДокументОбъект.МоментВремени < &МоментВремени
	|		КОНЕЦ
	|	И ДокументОбъект.Ссылка <> &Ссылка
	|	И &РучнойВвод
	|   И &Проведенные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	МАКСИМУМ(РегистрацияДокументовВЭДО.Документ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДокументОбъект.Ссылка ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|ИЗ
	|	Документ.Выписка КАК ДокументОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|		ПО ДокументОбъект.Ссылка = РегистрацияДокументовВЭДО.Документ
	|ГДЕ
	|	ДокументОбъект.Дата <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ДокументОбъект.ПометкаУдаления = &ПометкаУдаления
	|	И ДокументОбъект.Номер ПОДОБНО &Префикс
	|	И ВЫБОР
	|			КОГДА &ЭтоНовый
	|				ТОГДА ДокументОбъект.Дата > &Дата
	|			ИНАЧЕ ДокументОбъект.МоментВремени > &МоментВремени
	|		КОНЕЦ
	|	И ДокументОбъект.Ссылка <> &Ссылка
	|	И &РучнойВвод
	|   И &Проведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТекущийНомер.Количество) КАК Количество,
	|	МАКСИМУМ(ТекущийНомер.Перенумерация) КАК Перенумерация,
	|	МАКСИМУМ(ТекущийНомер.ЕстьВЭДО) КАК ЕстьВЭДО
	|ИЗ
	|	ТекущийНомер КАК ТекущийНомер";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Выписка",ИмяДокумента);
	
	Запрос.УстановитьПараметр("Префикс", Префикс + Формат(ДокументОбъект.Дата, "ДФ=yy") + "%");
	Запрос.УстановитьПараметр("Дата", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", ДокументОбъект.МоментВремени());
	Запрос.УстановитьПараметр("ЭтоНовый", ДокументОбъект.ЭтоНовый());
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	Если МетаданныеДокумента.Реквизиты.Найти("РучнойВвод") = Неопределено Тогда 
		Запрос.УстановитьПараметр("РучнойВвод", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&РучнойВвод"," Не ДокументОбъект.РучнойВвод");
	КонецЕсли;
	
	Если ИмяДокумента = "Входящий" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Проведенные", "ДокументОбъект.Проведен");
	Иначе
		Запрос.УстановитьПараметр("Проведенные", Истина);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	СоставнойПрефикс = Префикс + Формат(ДокументОбъект.Дата, "ДФ=yyMMdd") + "-";
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество + 1;
	Иначе
		Количество = 1;
	КонецЕсли;
	
	КоличествоСимволов = Макс(5, СтрДлина(Префикс) + СтрДлина(Формат(Количество,"ЧГ=")));
	Номер = СоставнойПрефикс + Формат(Количество, "ЧЦ="+(КоличествоСимволов-СтрДлина(Префикс))+"; ЧДЦ=0; ЧВН=; ЧГ=0");
	
	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("ПринудительнаяПеренумерация") Тогда
		Если Номер <> СокрЛП(ДокументОбъект.Номер) И ЗначениеЗаполнено(Выборка.ЕстьВЭДО) Тогда 
			ТекстОшибки = "Есть документы помещенные в ЭДО позже этого документа!
			|"+Выборка.ЕстьВЭДО;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	Возврат Номер;

КонецФункции // ПолучитьНомер()

Функция ЭтоКорпоративноеДействие(ВидОперации) Экспорт
	ВидыОпераций = Справочники.ВидыОпераций;
	
	Возврат ВидОперации = ВидыОпераций.Выкуп
		ИЛИ ВидОперации = ВидыОпераций.Конвертация
		ИЛИ ВидОперации = ВидыОпераций.НачислениеДивидендов
		ИЛИ ВидОперации = ВидыОпераций.Погашение
		ИЛИ ВидОперации = ВидыОпераций.ПогашениеНКД
		ИЛИ ВидОперации = ВидыОпераций.ПогашениеЦБПолное
		ИЛИ ВидОперации = ВидыОпераций.ПогашениеЦБЧастичное
		ИЛИ ВидОперации = ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
		ИЛИ ВидОперации = ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		ИЛИ ВидОперации = ВидыОпераций.НачислениеДоходовЦБ;
КонецФункции

// Возвращает Истина, если за период проверки у документов обнаружены повторяющиеся номера (задвоение номеров),
// иначе - Ложь.
// Если у документа есть реквизит РучнойВвод и он установлен, такой документ не участвует в проверке.
// Если параметр КонецПериода не указан, проверка выполняется внутри дня НачалоПериода.
Функция ЕстьПовторяющиесяНомераДокументов(ОбъектМетаданныхДокумент, Знач НачалоПериода, Знач КонецПериода = Неопределено) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(?(КонецПериода = Неопределено, НачалоПериода, КонецПериода));
	// Проверка
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументПроверки.Номер КАК Номер,
	|	КОЛИЧЕСТВО(ДокументПроверки.Ссылка) КАК КоличествоСсылок
	|ИЗ
	|	Документ.Поручение КАК ДокументПроверки
	|ГДЕ
	|	ДокументПроверки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ДокументПроверки.ПометкаУдаления
	|	И НЕ ДокументПроверки.РучнойВвод
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументПроверки.Номер
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ДокументПроверки.Ссылка) > 1";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Поручение", ОбъектМетаданныхДокумент.Имя);
	Если НЕ ОбщегоНазначения.ЕстьРеквизитДокумента("РучнойВвод", ОбъектМетаданныхДокумент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументПроверки.РучнойВвод", "ЛОЖЬ");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Обнаружены повторяющиеся номера в документах "+ОбъектМетаданныхДокумент.Синоним
			+" за "+ПредставлениеПериода(НачалоПериода, КонецПериода)+" :";
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = Сообщение.Текст + Символы.ПС + "№ " + СокрЛП(Выборка.Номер) + " Документов: " + Выборка.КоличествоСсылок;
		КонецЦикла;
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;
КонецФункции

//Формирует префикс для документа 
//Параметры:	ДокументОбъект = документ объект;
//Возврат:		Строка
Функция ПолучитьПрефиксНомера(ДокументОбъект) Экспорт 
		
	ТипДокумента = ТипЗнч(ДокументОбъект);	
	ДатаНовыхПрефиксов = Константы.ДатаПрефиксовПоПризнакуНФИ.Получить();
	МассивДокументовИзРегистраПрефиксов = ТипыДокументовДляУстановкиПрефиксов();
	МассивАдминистративныхДокументов = ТипыАдминистративныхДокументов();
	
	Если ДокументОбъект.Дата <= ДатаНовыхПрефиксов Тогда
		
		ПрефиксНомера = СущПрефикс(ДокументОбъект.номер);
	
	ИначеЕсли МассивДокументовИзРегистраПрефиксов.Найти(ТипДокумента) <> Неопределено Тогда
		
		ПрефиксНомера = ПрефиксИзРегистра("ДокументОбъект." + ДокументОбъект.Метаданные().Имя, ДокументОбъект.Дата , , "Д");	
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Выписка") Тогда
		
		ПрефиксНомера = ПрефиксДокументаВыписка(ДокументОбъект);
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ГлобальнаяОперация") Тогда		
		
		ПрефиксНомера = ПрефиксПоСчетуДепо(ДокументОбъект,"Г");

	ИначеЕсли МассивАдминистративныхДокументов.Найти(ТипДокумента) <> Неопределено Тогда  
		  
		ПрефиксНомера = ПрефиксПоСчетуДепо(ДокументОбъект,"А");
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ОперацииЦБ") Тогда
		
		ПрефиксНомера = ПрефиксДокументаОперацииЦБ(ДокументОбъект);	
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ОтменаПоручения") Тогда
				
		ПрефиксНомера = ПрефиксПоСчетуДепо(ДокументОбъект.ОтменяемоеПоручение,"А");
				
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Поручение") Тогда	
		
		ПрефиксНомера = ПрефиксДокументаПоручение(ДокументОбъект);
				
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.УчастиеВКД") Тогда
		
		ПрефиксНомера = ПрефиксПоСчетуДепо(ДокументОбъект,"К");
				
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЦенныеБумагиОбслуживание") Тогда
		
		ПрефиксНомера = ПрефиксЦенныеБумагиОбслуживание(ДокументОбъект);
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ФормированиеОтчетаВыписки") Тогда 
		
		ПрефиксНомера = ПрефиксПоСчетуДепо(ДокументОбъект,"И");
				
	Иначе 
		
		ПрефиксНомера = "Д";
		
	КонецЕсли;
	
	Возврат ПрефиксНомера;
	
КонецФункции

Функция ПрефиксПоСчетуДепо(Документ, ПрефиксЕслиНеНФИ)
	
	ПрефиксНомера = "";
	СчетДепо = Документ.СчетДепо;
	
	Если ЗначениеЗаполнено(СчетДепо) и СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		
		ПрефиксНомера = "О";		
		
	Иначе
		
		ПрефиксНомера = ПрефиксЕслиНеНФИ;
		
	КонецЕсли;
	
	Возврат ПрефиксНомера;
	
КонецФункции

Функция СущПрефикс(НомерДокумента)
	
	Префикс = "";
	
	Для индекс = 1 по 3 Цикл
		
		Символ = Сред(НомерДокумента, Индекс, 1);
		
		Если КодСимвола(Символ) >= 1040 И КодСимвола(Символ) <= 1071 Тогда
			
			Префикс = Префикс + Символ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Префикс;
	
КонецФункции

Функция ТипыАдминистративныхДокументов()
	
	МасиивДокументов = Новый Массив();
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ОткрытиеСчетаДепо"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ОткрытиеРазделаСчетаДепо"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ЗакрытиеСчетаДепо"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ЗакрытиеРазделаСчетаДепо"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.КорректировкаРеквизитовСчетаДепо"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.НазначениеПредставителяСчетаДепо"));
	
	Возврат МасиивДокументов;
	
КонецФункции

Функция ТипыДокументовДляУстановкиПрефиксов()
	
	МасиивДокументов = Новый Массив();
	// П
	МасиивДокументов.Добавить(Тип("ДокументОбъект.Входящий"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.Исходящий"));
	// Н
	МасиивДокументов.Добавить(Тип("ДокументОбъект.НеттоПоручение"));
	// АД
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ИзменениеАнкетныхДанных"));
	// А
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ИзменениеКатегорииСчетовДепонента"));
	// С
	МасиивДокументов.Добавить(Тип("ДокументОбъект.иц_СводноеПоручение"));
	// Г
	МасиивДокументов.Добавить(Тип("ДокументОбъект.КонвертацияЦБ"));
	// КД
	МасиивДокументов.Добавить(Тип("ДокументОбъект.КорпоративноеДействие_Новый"));
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ПогашениеЦБ"));
	// ПБ
	МасиивДокументов.Добавить(Тип("ДокументОбъект.ПринудительнаяБлокировкаЦБ"));
	// РС
	МасиивДокументов.Добавить(Тип("ДокументОбъект.РаскрытиеСпискаВладельцев"));
	
	Возврат МасиивДокументов;

КонецФункции

Функция ПрефиксДокументаОперацииЦБ(Документ)
	
	ДокументОснование = Документ.ДокументОснование;	
	СчетДепо = Документ.СчетДепо;
	Префикс = "";
	
	Если ЗначениеЗаполнено(СчетДепо) и СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда
		
		Префикс = "О";
		
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение")
		И НЕ (ЗначениеЗаполнено(Макс(ДокументОснование.ДатаИсполненияПоручения,ДокументОснование.ДатаИсполненияПоручения))
		ИЛИ (Документ.СчетДепоМХ = Документ.СчетДепоМХПолучатель И Документ.РазделСчетаДепоМХ = Документ.РазделСчетаДепоМХПолучатель)) Тогда
			 		 
		Префикс = "НП";
			 
	Иначе		
		
		Префикс = ПрефиксИзРегистра("Документ.ОперацииЦБ", Документ.Дата, Документ.ВидОперацииД, "Д");
		
	КонецЕсли;
	
	Возврат Префикс;

КонецФункции

Функция ПрефиксДокументаВыписка(Документ)
		
	ДокументОснование = Документ.ДокументОснование;
	ВидОтчета = Документ.ВидОтчета;
	ОперацияЦБ = Документ.ОперацияЦБ;		
	СчетДепо = Документ.СчетДепо;	
	
	КлассОперации = Неопределено;
		
	Если ЗначениеЗаполнено(СчетДепо) и СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ Тогда				
		Возврат "О";						
	ИначеЕсли Перечисления.ВидыОтчетов.ЭтоВыпискаИлиОтчет(ВидОтчета) Тогда
		ВидОперации = ВидОтчета;
	Иначе
		Если ТипЗнч(ОперацияЦБ) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
			Если ОперацияЦБ.ВидГлобальнойОперации = Справочники.ВидыОпераций.УчастиеВКД Тогда
				ВидОперации = Справочники.ВидыОпераций.УчастиеВКД;
			Иначе
				ВидОперации = ОперацияЦБ.ВидГлобальнойОперации.КлассОпераций;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ОперацияЦБ) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
			Если ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.ПередачаВЗалог
			 или ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.СнятиеОбременения
			 или ОперацияЦБ.ВидОперацииД = Справочники.ВидыОпераций.ВозвратИзЗалога
			Тогда
				ВидОперации = ОперацияЦБ.ВидОперацииД;
			Иначе 
				ВидОперации = ОперацияЦБ.ВидОперацииД.КлассОпераций;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ОперацияЦБ) Тогда
				ВидОперации = "ДокументСсылка." + ОперацияЦБ.Метаданные().Имя;
			Иначе
				ВидОперации = "";
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
					КлассОперации = ДокументОснование.ВидОперацииД.КлассОпераций;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПрефиксИзРегистра("Документ.Выписка", Документ.Дата, ВидОперации, "СЛ", КлассОперации);

КонецФункции

Функция ПрефиксДокументаПоручение(Документ)
	
	ВидОперацииД = Документ.ВидОперацииД;
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ОтменаПоручения Тогда
		ОтменяемоеПоручение = Документ.ОтменяемоеПоручение;
		СчетДепо = ОтменяемоеПоручение.СчетДепо;
		ВидСчетаДепо = ОтменяемоеПоручение.ВидСчетаДепо;
		Если Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(Документ.ОтменяемоеПоручение)
			И ОтменяемоеПоручение.ЦенныеБумагиСписываемые.Количество() > 0 Тогда
			ЦБ = ОтменяемоеПоручение.ЦенныеБумагиСписываемые[0].ЦеннаяБумага;
		Иначе
			ЦБ = ОтменяемоеПоручение.ЦБ;
		КонецЕсли;
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.Конвертация Тогда
		ТабЧасть = Документ.ЦенныеБумагиСписываемые;
		Если ТабЧасть.Количество() > 0 Тогда 
			ЦБ = ТабЧасть[0].ЦеннаяБумага;
		КонецЕсли; 
	Иначе
		Если Документы.Поручение.ЭтоНеторговоеПоручениеСоСпискомЦБ(Документ) И Документ.ЦенныеБумагиСписываемые.Количество() > 0 Тогда
			ЦБ = Документ.ЦенныеБумагиСписываемые[0].ЦеннаяБумага;
		Иначе
			ЦБ = Документ.ЦБ;
		КонецЕсли;
		СчетДепо = Документ.СчетДепо;
		ВидСчетаДепо = Документ.ВидСчетаДепо;	
	КонецЕсли;
	
	КлассОперации = Неопределено;
	ПрефиксНомера = "";
		
	Если ТипЗнч(ВидОперацииД) = Тип("СправочникСсылка.ВидыОпераций") Тогда
		Если ЗначениеЗаполнено(ВидОперацииД.КлассОпераций) Тогда
			КлассОперации = ВидОперацииД.КлассОпераций;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоСлужебноеПоручение = ПоручениеЯвляетсяСлужебным(Документ);
	
	Если (ЗначениеЗаполнено(ЦБ) и ЦБ.НФИ = 1)
		или (ЗначениеЗаполнено(СчетДепо) и СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ)
		или (ЗначениеЗаполнено(ВидСчетаДепо) и ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ) Тогда 
		
		Если ЭтоСлужебноеПоручение Тогда
			ПрефиксНомера = "СО";
		Иначе
			ПрефиксНомера = "О";
		КонецЕсли;
		
	Иначе
		
		ПрефиксНомера = ПрефиксИзРегистра("Документ.Поручение", Документ.Дата, ВидОперацииД, "СЛ", КлассОперации, ЭтоСлужебноеПоручение);
		
	КонецЕсли;
	
	Возврат ПрефиксНомера; 
	
КонецФункции

Функция ПрефиксЦенныеБумагиОбслуживание(Документ)
	
	ПрефиксНомера = "";
	ЦБ = Документ.ЦБ;
	
	Если ЗначениеЗаполнено(ЦБ) и ЦБ.НФИ = 1 Тогда	
		ПрефиксНомера = "О";
	Иначе
		ПрефиксНомера = "А";
	КонецЕсли;
	
	Возврат ПрефиксНомера;
	
КонецФункции

Функция ПрефиксИзРегистра(ТипДокумента, ДатаДокумента, ВидОперацииД = Неопределено, ПрефиксСлужебный, КлассОперации = Неопределено, ЭтоСлужебноеПоручение = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);	
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииД);
	
	Если КлассОперации = Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Префиксы.Префикс,
		|	Префиксы.ПрефиксСлужебный
		|ИЗ
		|	РегистрСведений.ПрефиксыНомеровДокументов.СрезПоследних(
		|			&ДатаДокумента,
		|			ТипДокумента = &ТипДокумента
		|				И ВидОперации = &ВидОперации) КАК Префиксы";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Префиксы.Префикс,
		|	Префиксы.ПрефиксСлужебный
		|ИЗ
		|	РегистрСведений.ПрефиксыНомеровДокументов.СрезПоследних(
		|			&ДатаДокумента,
		|			ТипДокумента = &ТипДокумента
		|				И ВидОперации = &ВидОперации) КАК Префиксы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Префиксы.Префикс,
		|	Префиксы.ПрефиксСлужебный
		|ИЗ
		|	РегистрСведений.ПрефиксыНомеровДокументов.СрезПоследних(
		|			&ДатаДокумента,
		|			ТипДокумента = &ТипДокумента
		|				И ВидОперации = &КлассОперации) КАК Префиксы";
		Запрос.УстановитьПараметр("КлассОперации", КлассОперации);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		ПрефиксНомера = ПрефиксСлужебный;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ЭтоСлужебноеПоручение И ЗначениеЗаполнено(Выборка.ПрефиксСлужебный) Тогда
			ПрефиксНомера = Выборка.ПрефиксСлужебный;
		Иначе 
			ПрефиксНомера = Выборка.Префикс;
		КонецЕсли;
		
	КонецЕсли;
	
    Возврат ПрефиксНомера;
	
КонецФункции

Функция ПоручениеЯвляетсяСлужебным(ДокументОбъект)
	
	ЭтоСлужебноеПоручение = Ложь; 
	
	Если ДокументОбъект.ЗагруженоИзВнешнегоИсточника Тогда
		ЭтоСлужебноеПоручение = Ложь;
	Иначе
		Если ТипЗнч(ДокументОбъект.Инициатор) = Тип("СправочникСсылка.Организации") Тогда
			Если ДокументОбъект.ВидИнициатора = 0 Тогда //Инициатор: Депозитарий
				ЭтоСлужебноеПоручение = Истина;
			Иначе   //Инициатор: Брокер
				ЭтоСлужебноеПоручение = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭтоСлужебноеПоручение;
	
КонецФункции

//Возвращает соответствие Документ, номер документа
//Параметры:	ИмяДОкумента  = ДОкумент.Метаданные().Имя
//				Префикс       = строка
//              НачалоПериода = ДатаВремя
//				КонецПериода  = ДатаВремя       (дата начала и дата конца должна быть в рамках одного дня)
//Возврат:      Соответствие: Документ,НомерДОкумента.
Функция ПолучитьСписокДокументовЗаПериод(ИмяДокумента, НачалоПериода, КонецПериода)Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументОбъект.Ссылка
	|ПОМЕСТИТЬ ВТДок
	|ИЗ
	|	Документ.Выписка КАК ДокументОбъект
	|ГДЕ
	|	ДокументОбъект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
	|	И НЕ ДокументОбъект.ПометкаУдаления
	|	И &РучнойВвод
	|	И &Проведенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДок.Ссылка КАК Документ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДокПредшествующие.Ссылка) КАК КоличествоПредшествующих,
	|	ВЫБОР
	|		КОГДА РегистрацияДокументовВЭДО.Документ ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыгруженВЭДО
	|ИЗ
	|	ВТДок КАК ВТДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДок КАК ВТДокПредшествующие
	|		ПО ВТДок.Ссылка.МоментВремени > ВТДокПредшествующие.Ссылка.МоментВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|		ПО ВТДок.Ссылка = РегистрацияДокументовВЭДО.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДок.Ссылка,
	|	ВЫБОР
	|		КОГДА РегистрацияДокументовВЭДО.Документ ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТДок.Ссылка.МоментВремени";	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Выписка",ИмяДокумента);
	
	Запрос.УстановитьПараметр("ДатаНачала"		, НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания"	, КонецПериода);
	
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	Если МетаданныеДокумента.Реквизиты.Найти("РучнойВвод") = Неопределено Тогда 
		Запрос.УстановитьПараметр("РучнойВвод", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&РучнойВвод"," Не ДокументОбъект.РучнойВвод");
	КонецЕсли;
	
	Если ИмяДокумента = "Входящий" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Проведенные", "ДокументОбъект.Проведен");
	Иначе
		Запрос.УстановитьПараметр("Проведенные", Истина);
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомераДокументов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВыгруженВЭДО Тогда 
			Продолжить;
		КонецЕсли;	
		НомераДокументов.Добавить(Выборка.Документ);
	КонецЦикла;
	
	Возврат НомераДокументов;

КонецФункции
